cfd/legendCoupe_3_4/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2;

deltaT          0.0001;

writeControl    timeStep;

writeInterval   2000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    fieldAverage
    {
        type                fieldAverage;
        libs                ("libfieldFunctionObjects.so");

        fields
        (
            U
            {
                mean            on;
                prime2Mean      off;
                base            time;
                //windowType   	approximate;
                //window          10;
                
            }
            p
            {
            
                mean            on;
                prime2Mean      off;
                base            time;
                
            }
        );
        
    timeStart       1.4;
    timeEnd         2;
    writeControl    timeStep;
    writeInterval   2000;
    }
    
    
    solverInfo
{
    type            solverInfo;
    libs            ("libutilityFunctionObjects.so");
    fields          (U p k omega);
    writeResidualFields no;
}

    yplus
    
{
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        enabled         true;
        writeControl    outputTime;
}

    //#include "streamLines"
    //#include "wallBoundedStreamLines"
    #include "forceCoeffs"
    #include "ensightWrite"

}


// ************************************************************************* //
