cfd/legendCoupe_3_4/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    #include "include/fixedInlet"

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    ground
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    COUPE_UPPER_BODY
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    COUPE_LOWER_BODY
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    COUPE_FRONT_WHEEL
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    COUPE_REAR_WHEEL
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    symmetry
    {
        type            symmetry;
    }

    #include "include/BackUpperPatches"
}


// ************************************************************************* //
